## Import & DF's

In [1]:
import pandas as pd

In [2]:
df_airports = pd.read_csv("../data/airportsdata/airports.csv")
df_iata = pd.read_csv("../data/airportsdata/iata_macs.csv")

df_train = pd.read_csv("../data/zindi/train.csv")

## First EDA

In [3]:
df_train.shape

(107833, 10)

In [4]:
df_train.head()

,ID,DATOP,FLTID,DEPSTN,ARRSTN,STD,STA,STATUS,AC,target
0,train_id_0,2016-01-03,TU 0712,CMN,TUN,2016-01-03 10:30:00,2016-01-03 12.55.00,ATA,TU 32AIMN,260.0
1,train_id_1,2016-01-13,TU 0757,MXP,TUN,2016-01-13 15:05:00,2016-01-13 16.55.00,ATA,TU 31BIMO,20.0
2,train_id_2,2016-01-16,TU 0214,TUN,IST,2016-01-16 04:10:00,2016-01-16 06.45.00,ATA,TU 32AIMN,0.0
3,train_id_3,2016-01-17,TU 0480,DJE,NTE,2016-01-17 14:10:00,2016-01-17 17.00.00,ATA,TU 736IOK,0.0
4,train_id_4,2016-01-17,TU 0338,TUN,ALG,2016-01-17 14:30:00,2016-01-17 15.50.00,ATA,TU 320IMU,22.0

In [5]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107833 entries, 0 to 107832
Data columns (total 10 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      107833 non-null  object
 1   DATOP   107833 non-null  object
 2   FLTID   107833 non-null  object
 3   DEPSTN  107833 non-null  object
 4   ARRSTN  107833 non-null  object
 5   STD     107833 non-null  object
 6   STA     107833 non-null  object
 7   STATUS  107833 non-null  object
 8   AC      107833 non-null  object
 9   target  107833 non-null  float64
dtypes: float64(1), object(9)
memory usage: 8.2+ MB

In [6]:
df_train.isna().mean().sort_values(ascending=False)

ID        0.0
DATOP     0.0
FLTID     0.0
DEPSTN    0.0
ARRSTN    0.0
STD       0.0
STA       0.0
STATUS    0.0
AC        0.0
target    0.0
dtype: float64

In [7]:
df_train['target'].value_counts()

target
0.0       38168
10.0       3038
15.0       2680
5.0        2406
20.0       2310
          ...
904.0         1
2058.0        1
2655.0        1
2602.0        1
1007.0        1
Name: count, Length: 968, dtype: int64

In [8]:
df_train.columns

Index(['ID', 'DATOP', 'FLTID', 'DEPSTN', 'ARRSTN', 'STD', 'STA', 'STATUS',
       'AC', 'target'],
      dtype='object')

In [9]:
pd.to_datetime(df_train['DATOP'], errors='coerce')

0        2016-01-03
1        2016-01-13
2        2016-01-16
3        2016-01-17
4        2016-01-17
            ...
107828   2018-07-05
107829   2018-01-13
107830   2018-11-07
107831   2018-01-23
107832   2018-11-13
Name: DATOP, Length: 107833, dtype: datetime64[ns]

In [10]:
df_train.select_dtypes(include='object').columns

Index(['ID', 'DATOP', 'FLTID', 'DEPSTN', 'ARRSTN', 'STD', 'STA', 'STATUS',
       'AC'],
      dtype='object')

In [11]:
df_train['DEPSTN'].value_counts().head(10)

DEPSTN
TUN    42522
DJE    10252
ORY     6755
MIR     5248
MRS     2845
LYS     2358
NCE     2227
ALG     1573
MXP     1534
IST     1442
Name: count, dtype: int64

In [12]:
df_train['ARRSTN'].value_counts().head(10)

ARRSTN
TUN    42572
DJE    10198
ORY     6755
MIR     5251
MRS     2845
LYS     2359
NCE     2228
ALG     1573
MXP     1534
IST     1442
Name: count, dtype: int64

In [13]:
df_train['STATUS'].value_counts().head(10)

STATUS
ATA    93679
SCH    13242
DEP      467
RTR      294
DEL      151
Name: count, dtype: int64

In [14]:
df_train['AC'].value_counts().head(10)

AC
TU 320IMU    4724
TU 320IMW    4685
TU 320IMT    4634
TU 320IMR    4601
TU 320IMV    4589
TU 320IMS    4214
TU 32AIMP    4146
TU 32AIML    4122
TU 31BIMQ    4052
TU 32AIMH    4026
Name: count, dtype: int64

In [15]:
# Sanity Check
df_train.describe()

              target
count  107833.000000
mean       48.733013
std       117.135562
min         0.000000
25%         0.000000
50%        14.000000
75%        43.000000
max      3451.000000

In [16]:
df_airports.head()

,icao,iata,name,city,subd,country,elevation,lat,lon,tz,lid
0,00AA,NaN,Aero B Ranch Airport,Leoti,Kansas,US,3435.0,38.70402,-101.47391,America/Chicago,00AA
1,00AK,NaN,Lowell Field,Anchor Point,Alaska,US,252.0,59.94889,-151.69222,America/Anchorage,00AK
2,00AL,NaN,Epps Airpark,Harvest,Alabama,US,820.0,34.86481,-86.77028,America/Chicago,00AL
3,00AN,NaN,Katmai Lodge Airport,King Salmon,Alaska,US,80.0,59.09347,-156.45583,America/Anchorage,00AN
4,00AR,NaN,Arland Airport,Bennington,Kansas,US,1352.0,38.96965,-97.60156,America/Chicago,00AR

In [17]:
df_airports.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28270 entries, 0 to 28269
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   icao       28270 non-null  object
 1   iata       7859 non-null   object
 2   name       28270 non-null  object
 3   city       25440 non-null  object
 4   subd       27497 non-null  object
 5   country    28207 non-null  object
 6   elevation  28270 non-null  float64
 7   lat        28270 non-null  float64
 8   lon        28270 non-null  float64
 9   tz         28270 non-null  object
 10  lid        12610 non-null  object
dtypes: float64(3), object(8)
memory usage: 2.4+ MB

In [18]:
df_iata.head()

  Country City Code     City Name Airport Code        Airport Name
0      AE       DXB         Dubai          DWC     Al Maktoum Intl
1      AE       DXB         Dubai          DXB       International
2      AR       BUE  Buenos Aires          AEP       Jorge Newbery
3      AR       BUE  Buenos Aires          EZE  Ministro Pistarini
4      AU       MEL     Melbourne          AVV              Avalon

In [19]:
df_iata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country       89 non-null     object
 1   City Code     89 non-null     object
 2   City Name     89 non-null     object
 3   Airport Code  89 non-null     object
 4   Airport Name  89 non-null     object
dtypes: object(5)
memory usage: 3.6+ KB